aleksMuhicFri2/stm32n6-edge-audio-classifier/Projects/GS/Src/audio_bm.c
  /* Audio samples acquisition */
  AudioCapture_ring_buff_consume(acq_buf,&acq_ctx_ptr->ring_buff,AUDIO_ACQ_LEN);
#ifdef APP_LP
  NPU_SRAM_on();
#endif /* APP_LP */

  /* Audio pre processing */
  PreProc_DPU(&proc_ctx_ptr->audioPreCtx, proc_buf, proc_ctx_ptr->ai_in_ptr );

#if (CTRL_X_CUBE_AI_MODEL_OUTPUT_1 == CTRL_AI_CLASS_DISTRIBUTION )
  isNotSilence = (proc_ctx_ptr->audioPreCtx.S_Spectr.spectro_sum > CTRL_X_CUBE_AI_SPECTROGRAM_SILENCE_THR);
  isPlayback = test_probe_in(&proc_ctx_ptr->aiCtx,&proc_ctx_ptr->audioPreCtx);
#endif

#ifdef APP_LP
  NPU_on();
#endif /* APP_LP */
  /* AI processing */
  AiDPUProcess(&proc_ctx_ptr->aiCtx);

#if (CTRL_X_CUBE_AI_MODEL_OUTPUT_1 == CTRL_AI_CLASS_DISTRIBUTION )
  printInferenceResults(&proc_ctx_ptr->aiCtx, isNotSilence || isPlayback);
#endif

#if (CTRL_X_CUBE_AI_POSTPROC==CTRL_AI_ISTFT)
  PostProc_DPU(&proc_ctx_ptr->audioPostCtx,
      proc_ctx_ptr->audioPreCtx.pCplxSpectrum,
      (float32_t *) proc_ctx_ptr->ai_out_ptr,
      proc_ctx_ptr->audio_out);
#endif

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
  int16_t * audioPtr = (AudioProcIsOn) ?
      &proc_ctx_ptr->audio_out[AUDIO_OUT_FIRST] : (int16_t *)acq_buf ;
  AudioPlayBack(&proc_ctx_ptr->audioPlayBackCtx, audioPtr , AUDIO_ACQ_LEN);
#endif

#ifdef APP_LP
  NPU_off();
#endif /* APP_LP */

#ifdef APP_DVFS 
  pm_set_opp_min(OPP_MIN);
#endif 

  BSP_LED_Toggle(LED_GREEN);
  
  return cont;
}

/**
* @brief  Initializes Audio capture from microphone
* @param  acq_ctx_ptr pointer to acquisition context
* @retval None
*/
void initAudioCapture(AudioBM_acq_t *ctx_ptr)
{
  ctx_ptr->ring_buff.nbSamples = ((PATCH_LENGTH / CAPTURE_BUFFER_SIZE) + 1 ) \
                                                        * CAPTURE_BUFFER_SIZE ;
  ctx_ptr->ring_buff.nbBytesPerSample = 2;
  ctx_ptr->ring_buff.nbFrames = 2;
  AudioCapture_ring_buff_alloc(&ctx_ptr->ring_buff);
  /* Initialize record */
  Record_Init();
}

/**
* @brief  Starts Audio capture from microphone
* @param  acq_ctx_ptr pointer to acquisition context
* @retval None
*/
void startAudioCapture(AudioBM_acq_t * ctx_ptr)
{
  /* Start record */
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_Record(1, (uint8_t *) ctx_ptr->acq_buf,
                                         CAPTURE_BUFFER_SIZE * sizeof(int16_t)))
  {
    Error_Handler();
  }
}

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
/**
* @brief  Stops Audio Playback
* @param  None
* @retval None
*/
void stopAudioPlayBack(void)
{
  BSP_AUDIO_OUT_Stop(1);
}
#endif

/**
* @brief  Stops Audio Capture
* @param  None
* @retval None
*/
void stopAudioCapture(void)
{
  BSP_AUDIO_IN_Stop(1);
}

#ifdef APP_LP

/**
* @brief  NPU (Neural Processing Unit) RAM power on.
* @param  None.
* @retval None.
*/
void NPU_SRAM_on(void)
{
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();
  __HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();
}

/**
* @brief  NPU (Neural Processing Unit) power ram off.
* @param  None.
* @retval None.
*/
void NPU_SRAM_off(void)
{
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_DisableAXISRAM(&hramcfg);
  __HAL_RCC_AXISRAM6_MEM_CLK_DISABLE();
  __HAL_RCC_CACHEAXIRAM_MEM_CLK_DISABLE();
}

/**
* @brief  NPU (Neural Processing Unit) power on.
* @param  None.
* @retval None.
*/
void NPU_on(void)
{
  NPU_SRAM_on();
  NPU_Config();
  __HAL_RCC_XSPI2_CLK_ENABLE();
}

/**
* @brief  NPU (Neural Processing Unit) power off.
* @param  None.
* @retval None.
*/
void NPU_off(void)
{
  __HAL_RCC_NPU_CLK_DISABLE();
  __HAL_RCC_CACHEAXI_CLK_DISABLE();
  NPU_SRAM_off();
  __HAL_RCC_XSPI2_CLK_DISABLE();
}

#endif /* APP_LP */

#ifdef APP_DVFS
/**
  * @brief Initialize the UART MSP.
  * @param huart UART handle.
  * @retval None
  */
void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);

  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState       = RCC_MSI_ON;
  RCC_OscInitStruct.MSIFrequency   = RCC_MSI_FREQ_4MHZ;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    /* Initialization Error */
    while(1);
  }

  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
  /*  Select MSI for UART */
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_MSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
  __BKPT(0);
  }
}
#endif /* APP_DVFS */

void printHeader(void)
{
	my_printf(SEPARATION_LINE);
	my_printf("# Start Processing\n\r");
	my_printf(SEPARATION_LINE);

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
	my_printf("| Vu meter          ");
#else
	my_printf("                    ");
#endif
#ifdef CPU_STATS
	my_printf("| Frame   |  Cpu  |  Pre |  AI  | Post |");
#endif
	my_printf("\r\n");
	printf("AED_CSV_HEADER,frame,audio_active,decision,decision_confidence,"
	       "top1,top1_confidence,top2,top2_confidence,top3,top3_confidence,changed\r\n");
}

#ifdef CPU_STATS
void printCpuStats(void)
{
	/* display real time statistics */
	float pre_load = 100 * time_stats_get_avg(TIME_STAT_PRE_PROC)/CTRL_X_CUBE_AI_ACQ_LENGTH_MS;
	float ai_load = 100 * time_stats_get_avg(TIME_STAT_AI_PROC)/CTRL_X_CUBE_AI_ACQ_LENGTH_MS;
	float post_load = 100 * time_stats_get_avg(TIME_STAT_POST_PROC)/CTRL_X_CUBE_AI_ACQ_LENGTH_MS;
#if (CTRL_X_CUBE_AI_AUDIO_OUT!=COM_TYPE_HEADSET)
	my_printf("                    ");
#endif
	printf ("| %-8d|%6.2f%%|%6.2f|%6.2f|%6.2f|\r",time_stats_get_cnt(TIME_STAT_AI_PROC),pre_load+ai_load+post_load,pre_load, ai_load, post_load);
	fflush(stdout);
}
#endif

#if (CTRL_X_CUBE_AI_MODEL_OUTPUT_1 == CTRL_AI_CLASS_DISTRIBUTION )
/**
* @brief  Displays Inference processing outputs
* @param  None
* @retval None
*/
void printInferenceResults(const AIProcCtx_t* AIProcCtx, bool audio_active)
{
  /**
  * Specifies the labels for the classes of the demo.
  */

  const char* sAiClassLabels[CTRL_X_CUBE_AI_MODEL_CLASS_NUMBER]  = CTRL_X_CUBE_AI_MODEL_CLASS_LIST;
  float *nn_out =  (float *) AIProcCtx->p_stai_outputs[0];
  AudioEventResult_t result;
  const char *top_labels[AUDIO_EVENT_TOP_COUNT];
  const char *decision_label;

  if (AudioFilterResetRequested)
  {
    AudioFilterResetRequested = false;
    AudioEventFilter_Init();
  }

  if (!AudioProcIsOn)
  {
    static const char *paused_labels[AUDIO_EVENT_TOP_COUNT] =
        {"unknown", "unknown", "unknown"};
    static const float paused_scores[AUDIO_EVENT_TOP_COUNT] =
        {0.0F, 0.0F, 0.0F};
    AudioDisplay_Update("waiting", 0.0F, paused_labels, paused_scores, false);
    return;
  }

  AudioEventFilter_Update(nn_out, CTRL_X_CUBE_AI_MODEL_CLASS_NUMBER,
                          audio_active, &result);

  for (uint32_t rank = 0U; rank < AUDIO_EVENT_TOP_COUNT; rank++)
  {
    top_labels[rank] = (result.top_indices[rank] == AUDIO_EVENT_NO_CLASS) ?
                       "unknown" : sAiClassLabels[result.top_indices[rank]];
  }

